ezois_ka/oooezoiskaobmen/src/Documents/СогласиеНаПрисоединениеКЭДОБЗК/СогласиеНаПрисоединениеКЭДОБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласиеНаПрисоединениеКЭДОБЗК</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеДопуска</name>
    <type>
      <types>EnumRef.УсловияДопускаСотрудниковКЭДОБЗК</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиСервисаКабинетСотрудника/НастройкиСервисаКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСервисаКабинетСотрудника</name>
  <resources>
    <name>АдресПриложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>Идентификатор информационной системы в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <comment>Наименования информационной системы в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложения</name>
    <comment>Идентификатор приложения в сервисе, в котором развернута информационная система</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТестовыйТарифАктивирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьАбонентСервисаИнициализирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТребуетсяАктивацияТестовогоТарифа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСообщениеОбАктивацииТестовогоТарифаОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СервисЗаблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОбновитьНастройкиФункциональности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмени</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмениДоступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияDTO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбновитьУровеньДоступаКИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервисаАвторизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РегламентныеЗаданияЗаблокированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНедоступностиПриложения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/СогласиеНаПрисоединениеКЭДОБЗК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ИдентификаторКомандыПечатиЗаявления();
	КомандаПечати.Представление = НСтр("ru = 'Заявление на согласие'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.СогласиеНаПрисоединениеКЭДОБЗК";
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(
		КоллекцияПечатныхФорм,
		ИдентификаторКомандыПечатиЗаявления());
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьСогласияНаПрисоединениеКЭДОБЗК(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Согласие на присоединение к ЭДО'");
		ПечатнаяФорма.ПолныйПутьКМакету = Метаданные.Документы.СогласиеНаПрисоединениеКЭДОБЗК.Макеты.ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК_БумажныйДокумент.ПолноеИмя();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторКомандыПечатиЗаявления() Экспорт
	Возврат "ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК";
КонецФункции

Функция ПечатьСогласияНаПрисоединениеКЭДОБЗК(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Дата КАК Дата,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Номер КАК Номер,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Организация КАК Организация,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо.ФИО КАК ФизическоеЛицоФИО,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо.СтраховойНомерПФР КАК ФизическоеЛицоСНИЛС,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо.ДатаРождения КАК ФизическоеЛицоДатаРождения,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ФизическоеЛицо.Пол КАК ФизическоеЛицоПол,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Организация.ИНН КАК ОрганизацияИНН,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Ссылка КАК Ссылка,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Руководитель КАК Руководитель,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ДолжностьРуководителя КАК ДолжностьРуководителя,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ОснованиеПодписиРуководителя КАК ОснованиеПодписиРуководителя,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Руководитель.Пол КАК РуководительПол,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Руководитель.ФИО КАК РуководительФИО,
	               |	СогласиеНаПрисоединениеКЭДОБЗК.ДолжностьРуководителя.Представление КАК ДолжностьРуководителяПредставление
	               |ИЗ
	               |	Документ.СогласиеНаПрисоединениеКЭДОБЗК КАК СогласиеНаПрисоединениеКЭДОБЗК
	               |ГДЕ
	               |	СогласиеНаПрисоединениеКЭДОБЗК.Ссылка В(&МассивСогласий)";
	Запрос.УстановитьПараметр("МассивСогласий", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = УправлениеПечатью.МакетПечатнойФормы(
		"Документ.СогласиеНаПрисоединениеКЭДОБЗК.ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК_БумажныйДокумент");		
	НастройкиСервиса = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОбластьДокумент = Новый Структура;
		ПараметрыОбластьДокумент.Вставить("Номер", Выборка.Номер);
		ПараметрыОбластьДокумент.Вставить("Организация", Выборка.Организация);
		ПараметрыОбластьДокумент.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD"));
		ПараметрыОбластьДокумент.Вставить("ОрганизацияНаименованиеПолное", Выборка.ОрганизацияНаименованиеПолное);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
			ПараметрыОбластьДокумент,
			СтруктураПоляСПадежами("РуководительДолжность", Выборка.ДолжностьРуководителяПредставление, Выборка.ДолжностьРуководителя)
		); 
		Если ЗначениеЗаполнено(Выборка.РуководительПол) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
				ПараметрыОбластьДокумент,
				СтруктураПоляСПадежами("РуководительФИО", Выборка.РуководительФИО, Выборка.Руководитель, Выборка.РуководительПол)
			);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФизическоеЛицоПол) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
				ПараметрыОбластьДокумент,
				СтруктураПоляСПадежами("ФИО", Выборка.ФизическоеЛицоФИО, Выборка.ФизическоеЛицо, Выборка.ФизическоеЛицоПол)
			);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ОснованиеПодписиРуководителя) Тогда
			ШаблонОснование = НСтр("ru = ', действующего на основании %1'");
			ПараметрыОбластьДокумент.Вставить(
				"ОснованиеРуководителя",
				СтрШаблон(ШаблонОснование, Выборка.ОснованиеПодписиРуководителя));
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиСервиса.АдресПриложенияПоИмени) Тогда
			ПараметрыОбластьДокумент.Вставить("АдресЛичногоКабинета", НастройкиСервиса.АдресПриложенияПоИмени);
		Иначе
			ПараметрыОбластьДокумент.Вставить("АдресЛичногоКабинета", НастройкиСервиса.АдресПриложения);
		КонецЕсли;
		
		ОбластьДокумент = Макет.ПолучитьОбласть("Документ");
		ОбластьДокумент.Параметры.Заполнить(ПараметрыОбластьДокумент);
		ТабличныйДокумент.Вывести(ОбластьДокумент);
		
		ОрганизацияЮрАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			Выборка.Организация,
			ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"),
			,
			Выборка.Дата);
		ОрганизацияФактАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			Выборка.Организация,
			ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации"),
			,
			Выборка.Дата);
		АдресМестаПроживания = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			Выборка.ФизическоеЛицо,
			ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица"),
			,
			Выборка.Дата);
		ДокументУдостоверяющийЛичность = РегистрыСведений.ДокументыФизическихЛиц.ДокументУдостоверяющийЛичностьФизлица(
			Выборка.ФизическоеЛицо);

		ПараметрыОбластьПодписи = Новый Структура;
		ПараметрыОбластьПодписи.Вставить("ОрганизацияНаименованиеПолное", Выборка.ОрганизацияНаименованиеПолное);
		ПараметрыОбластьПодписи.Вставить("ОрганизацияНаименованиеСокращенное", Выборка.ОрганизацияНаименованиеСокращенное);
		ПараметрыОбластьПодписи.Вставить("ОрганизацияЮрАдрес", ОрганизацияЮрАдрес);
		ПараметрыОбластьПодписи.Вставить("ОрганизацияФактАдрес", ОрганизацияФактАдрес);
		ПараметрыОбластьПодписи.Вставить("ОрганизацияИНН", Выборка.ОрганизацияИНН);
		Если ЗначениеЗаполнено(Выборка.ФизическоеЛицоПол) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
				ПараметрыОбластьПодписи,
				СтруктураПоляСПадежами("ФИО", Выборка.ФизическоеЛицоФИО, Выборка.ФизическоеЛицо, Выборка.ФизическоеЛицоПол)
			);
		КонецЕсли;
		ПараметрыОбластьПодписи.Вставить("АдресМестаПроживания", АдресМестаПроживания);
		ПараметрыОбластьПодписи.Вставить("ДокументУдостоверяющийЛичность", ДокументУдостоверяющийЛичность);
		ПараметрыОбластьПодписи.Вставить("СНИЛС", Выборка.ФизическоеЛицоСНИЛС);
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ОбластьПодписи.Параметры.Заполнить(ПараметрыОбластьПодписи);
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		Если Макет.Области.Найти("ШтампыЭП") <> Неопределено Тогда
			ОбластьШтампыЭП = Макет.ПолучитьОбласть("ШтампыЭП");
			ТабличныйДокумент.Вывести(ОбластьШтампыЭП);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 1, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
    Возврат ТабличныйДокумент;
	
КонецФункции

Функция СтруктураПоляСПадежами(ИмяПоля, Представление, СклоняемыйОбъект, Пол = Неопределено)
	
	СтруктураПоляСПадежами = Новый Структура;
	СтруктураПоляСПадежами.Вставить(ИмяПоля, Представление);
	
	ПолЧислом = 1;
	Если Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		ПолЧислом = 2;
	КонецЕсли;
	
	Если ТипЗнч(СклоняемыйОбъект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		 
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Именительный",	СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 1, СклоняемыйОбъект, ПолЧислом));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Родительный",	СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 2, СклоняемыйОбъект, ПолЧислом));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Дательный",	СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 3, СклоняемыйОбъект, ПолЧислом));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Винительный", 	СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 4, СклоняемыйОбъект, ПолЧислом));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Творительный", СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 5, СклоняемыйОбъект, ПолЧислом));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Предложный", 	СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 6, СклоняемыйОбъект, ПолЧислом));	
		
	Иначе
		
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Именительный",	СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 1, СклоняемыйОбъект));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Родительный",	СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 2, СклоняемыйОбъект));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Дательный",	СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 3, СклоняемыйОбъект));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Винительный", 	СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 4, СклоняемыйОбъект));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Творительный", СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 5, СклоняемыйОбъект));
		СтруктураПоляСПадежами.Вставить(ИмяПоля+"Предложный", 	СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, 6, СклоняемыйОбъект));	
		
	КонецЕсли;

	Возврат СтруктураПоляСПадежами;
	
КонецФункции

#КонецОбласти

#КонецЕсли
